## Machine Leaning 실습

### Regression With Python

In [2]:
# 1. 패키지 호출
import pandas as pd 
import numpy as np

In [25]:
# 2. 데이터 with pandas DataFrame

Data = pd.read_csv("01SR_Data.csv")
Data

   Country   Age  Year  Salary
0    Spain  27.0   3.0   48000
1    Spain   NaN   6.0   52000
2  Germany  30.0   2.0   54000
3   France  35.0   NaN   58000
4    Spain  38.0   NaN   61000
5  Germany  40.0  10.0   61000
6   France  37.0   7.0   67000
7   France  44.0  15.0   72000
8   France  48.0   NaN   79000
9  Germany  50.0  21.0   83000

In [26]:
# 3-1. 데이터 살펴보기
Data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Country  10 non-null     object
 1   Age      9 non-null      float64
 2   Year     7 non-null      float64
 3   Salary   10 non-null     int64
dtypes: float64(2), int64(1), object(1)
memory usage: 448.0+ bytes

In [27]:
Data.shape

(10, 4)

In [28]:
# 4-2. 데이터 정보확인

In [32]:
# 4. feature/label 나누기

feature = Data.drop(['Salary'], axis=1)
#features = Data[:,:2]
feature

   Country   Age  Year
0    Spain  27.0   3.0
1    Spain   NaN   6.0
2  Germany  30.0   2.0
3   France  35.0   NaN
4    Spain  38.0   NaN
5  Germany  40.0  10.0
6   France  37.0   7.0
7   France  44.0  15.0
8   France  48.0   NaN
9  Germany  50.0  21.0

In [34]:
label = Data['Salary']

label

0    48000
1    52000
2    54000
3    58000
4    61000
5    61000
6    67000
7    72000
8    79000
9    83000
Name: Salary, dtype: int64

In [35]:
# 5. 비어있는 값 채우기(mean)

Data.isnull().sum()

Country    0
Age        1
Year       3
Salary     0
dtype: int64

In [40]:
from sklearn.preprocessing import OneHotEncoder

In [39]:
from sklearn.impute import SimpleImputer
imp = SimpleImputer(strategy='mean')
imp.fit(feature)

ValueError: Cannot use mean strategy with non-numeric data:
could not convert string to float: 'Spain'

In [ ]:
# 6. One hot encoding

In [ ]:
# 7. Split Data

In [ ]:
# 8. Train

In [ ]:
# 8-1. Train_2

In [ ]:
# 9. Score

In [ ]:
# 10. Evalute